package org.olddriver.learndatastructure;

/**
 * 20200825
 * part 1
 */
public class DataStructure {
    /*
     * 数据
     * 能够输入计算机，并能用计算机处理的符号集合，数据可分为数值型数据，非数值型数据
     *
     * 数据元素
     * 组成数据的基本单位
     *
     * 数据项
     * 构成数据元素的最小单位
     *
     * 数据对象
     * 性质相同的数据元素的集合
     *
     * 数据结构
     * 元素之间具有特定关系的数据元素的集合
     *
     * 数据结构研究内容
     * 逻辑结构 指数据元素间的逻辑关系
     * 存储结构 指数据元素及其关系在内存中的表示形式
     * 运算及实现 对数据元素可以施加的操作及操作在存储结构上的实现
     * 逻辑结构是数据结构的抽象，存储结构是数据结构的实现
     *
     * 逻辑结构分类
     * i.线性结构
     * 集合中只有一个开始元素一个终端元素，所有元素最多只有一个直接前趋和一个直接后继。元素间具有一对一关系
     * ii.非线性结构
     * 集合中元素可以有多个直接前趋和多个直接后继，元素间具有一对多或多对多关系
     *
     * 存储结构分类
     * i.顺序存储结构
     * 使用一组连续存储单元依次存储数据元素，数据元素间的逻辑关系由元素存储位置表示
     * ii.链式存储结构
     * 使用一组任意存储单元存放数据元素，数据元素间的逻辑关系使用指针确定
     * iii.索引存储结构
     * iiii.散列存储结构
     *
     * 数据类型
     * 一组性质相同的值的集合以及在该值集合上的一组操作
     *
     * 抽象数据类型(abstract data type) adt
     * 一个数学模型以及在此数学模型上的一组操作
     * 抽象数据类型不考虑存储结构以及运算实现
     *
     * 程序是使用某种程序设计语言对算法的实现
     */
}
