package org.olddriver.learnjava;

public class JavaSyntax {
	/*
	 * java 
	 * java既是一种高级编程语言，也是一个平台
	 * 使用java语言编写代码包含在.java源文件中，通过javac编译器将源文件编译成字节码文件，然后通过java启动工具
	 * 可以在虚拟机上运行程序
	 * 平台一般指程序运行的硬件及软件环境，java平台不同于其他大多数平台，仅是软件环境。
	 * java平台由java虚拟机和api组成
	 * 
	 * 关键字 keyword
	 * java程序中被赋予特殊含义的单词，关键字都小写
	 * 
	 * 标识符 identifier
	 * 程序中自定义名称，包名，类名，方法名，变量名，常量名都属于标识符
	 * 标识符命名规则
	 * 标识符由数字，字母，下划线，美元符号构成
	 * 标识符不能以数字开头，标识符不能与关键字重复
	 * 标识符命名规范
	 * 包名要求所有字母小写
	 * 类名要求首字母大写，其后每个单词的首字母大写
	 * 方法名要求首字母小写，其后每个单词首字母大写
	 * 变量名要求首字母小写，其后每个单词首字母大写
	 * 常量名要求所有字母大写
	 * 
	 * 注释 comment
	 * 注解说明的文字
	 * java中包含三种注释，单行注释，多行注释，文档注释
	 * 单行注释中能够嵌套单行注释及多行注释
	 * 多行注释中不能嵌套多行注释
	 * 文档注释是java特有，定义在类，成员变量，成员方法上，可以通过javadoc工具提取
	 * 文档注释中可以包含html，文档标签
	 * 文档注释中常用文档标签
	 * @see
	 * 
	 */
}
