package org.olddriver.learnjava.oo;

/**
 * 20200429
 * part 9
 */
public class Declarations {
    /*
     * 声明实体
     * 通过声明将实体引入程序中
     * 实体包括包，导入类型，导入静态成员，类，接口，引用类型成员，形参及异常参数，局部变量
     * 名称
     * 通过名称引用声明实体，名称分为简单名称，限定名称
     * 简单名称由唯一标识符组成
     * 限定名称由标识符序列组成
     * 实体作用域
     * 在实体作用域中，可以通过简单名引用实体
     * 顶级类或接口作用域为其所在包中的所有类型
     *
     * 访问控制
     * 可访问性在编译时确定
     * 类，接口可访问性
     * 使用public修饰，类型可以被任意代码访问
     * 不使用修饰符修饰，类型隐式声明为包访问权限，类型只能被所在包中代码访问
     * 顶级类或接口仅有公共访问权限及包访问权限
     * 类，接口成员可访问性
     * 访问类型成员的前提是类型具有可访问性
     * 成员及构造器使用public修饰，可以被任意位置代码访问
     * 成员及构造器使用protected修饰，可以被成员及构造器所在包中代码访问及其他包中成员及构造器所在类型的子类型中代码访问
     * 成员及构造器使用包访问权限，可以被成员及构造器所在包中代码访问
     * 成员及构造器使用private修饰，可以被成员及构造器所在顶级类型中代码访问
     * 数组可访问性
     * 当数组元素可访问时，数组可访问
     *
     */
}
