package org.olddriver.learnos;

/**
 * 操作系统
 * 20210914
 * 第一部分
 */
public class OS {
    /**
     * 计算机系统
     * 计算机系统分为硬件系统和软件系统
     * 硬件系统包括cpu，存储器，外围设备等物理部件，各个部件通过系统总线连接
     * 软件系统包括系统软件，支撑软件，应用软件。用于指挥计算机系统按要求工作
     *
     * 硬件系统
     * cpu 包括计算单元，控制单元等
     *     控制单元用于解译机器指令，计算单元执行具体机器指令
     * 存储器  存储正在执行的程序和数据
     * 外围设备 包括输入设备，输出设备，存储设备，网络通信设备
     *
     * 总线
     * 连接硬件系统的各个部件
     * 总线分类
     * 内部总线 连接cpu内部部件
     * 系统总线 连接cpu，存储器，外围设备
     * 通信总线 连接不同计算机
     *
     * 存储器层次结构
     * 存储器采用分层结构，自顶向下依次为寄存器，高速缓存，主存储器，磁盘
     *
     * 外围设备
     *
     * 系统软件
     * 系统软件包括操作系统，语言处理程序
     * 操作系统是管理硬件软件资源的一系列系统集合
     * 语言处理程序将使用高级语言/汇编语言编写的程序翻译成机器语言程序
     *
     * 操作系统组成
     * 进程调度子系统
     * 进程通信子系统
     * 内存管理子系统
     * 设备管理子系统
     * 文件管理子系统
     * 网络通信子系统
     * 作业控制子系统
     *
     * 操作系统发展过程
     * 多道程序系统
     * 多个程序可以同时进入主存储器执行，提高cpu利用率
     * 为管理主存储器中多道程序，os引入进程概念。一个进程对应一个程序
     * 分时系统
     * 采用时间片轮转的方式为多个用户提供服务
     * 实时系统
     */
}
