package org.olddriver.learnjava.collections;

/**
 * 串
 * 20201018
 * 第五部分
 */
public class Strings {
    /**
     * 串
     * 特殊线性表，由n个字符构成的有限序列。n表示串长度，n等于0时，串为空串，空串用。
     * 子串
     * 由串中任意个连续字符构成的子序列，空串是任意串的子串
     * 真子串
     * 除了串本身以外的子串，称为串的真子串
     * 主串
     * 子串所在的串称为主串
     * 字符位置
     * 字符在序列中的序号称为字符在串中位置
     * 子串位置
     * 子串中第一个字符在序列中的序号
     * 空格串
     * 由n个空格组成的串，与空串不同
     * 串相等条件
     * 两个串长度相等且对应位置字符都相等。所有空串都相等
     *
     * 顺序串
     * 串的顺序存储结构
     * 顺序串实现
     * 使用数组存放字符，使用变量记录串长度
     *
     * 链串
     * 串的链式存储结构，可以在一个结点中存储多个字符，提高存储密度
     *
     * 串匹配算法
     * 确定子串在主串中第一次出现的位置
     * bf算法(brute-force)，也称为简单匹配法，使用穷举的思想。
     * 从主串的每一个字符开始，与子串进行比较
     *
     *
     *
     */
}
