package org.olddriver.learnalgorithm;

/**
 * 20200809
 * part 1
 */
public class Algorithm {
    /*
     * 算法(algorithm)
     * 完成特定任务的一系列步骤，对于任何输入，经过有限步计算都会产生输出。
     * 通过时间复杂度，额外空间复杂度，常数项时间评估算法优劣
     *
     * 常数时间操作
     * 操作执行需要的时间不随样本数量变化而变化，常见常数时间操作
     * 算数运算，位运算，关系运算，赋值运算，逻辑运算，数组寻址
     *
     * 时间复杂度
     * 描述算法执行常数时间操作次数的函数，忽略低阶项，忽略最高阶项系数，使用big O标记法表示
     * 常数时间操作时间复杂度为O(1)
     *
     * 额外空间复杂度
     * 描述算法中定义额外空间变量个数的函数
     * 输入参数不属于额外空间，输出结果不属于额外空间
     * 若算法中定义额外空间变量个数不随样本量变化而变化，那么额外空间复杂度为O(1)
     *
     */
}
